src/InformationRegisters/дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусЕдиницыТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.дсфСтатусыЕдиницТовараЯндексМаркет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСтока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.дсфТипыСтоковЯндексМаркет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СостояниеОбъектовХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияОбъектовХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/дсфИдентификаторыЯндексМаркет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>дсфИдентификаторыЯндексМаркет</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.дсфЗаявкаНаОтгрузку</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланОтгрузки</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланПоступления</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.дсфЗаявкаНаПриемку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/дсфСвязанныеОбъектыЗаявкаНаПриемкуЯндексМаркет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>дсфСвязанныеОбъектыЗаявкаНаПриемкуЯндексМаркет</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПланПоступления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланПоступления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОжидаемоеПоступление</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОжидаемоеПоступление</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаПриемку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.дсфЗаявкаНаПриемку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/дсфВерсииРеестровПриемкиЯндексМаркет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>дсфВерсииРеестровПриемкиЯндексМаркет</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипРеестра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.дсфТипыРеестровЯндексМаркет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРеестраКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРеестра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДанныеРеестра</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаПриемку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.дсфЗаявкаНаПриемку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторРеестра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/дсфТипыИдентификаторовЯндексМаркет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>дсфТипыИдентификаторовЯндексМаркет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ARTICLE</Name>
					<Comment>Идентификатор товара в системе партнера</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ASSORTMENT_ARTICLE</Name>
					<Comment>Идентификатор ассортиментного товара</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BOX_ID</Name>
					<Comment>Идентификатор коробки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CIS</Name>
					<Comment>Контрольный идентификационный знак из ЦРПТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IMEI</Name>
					<Comment>Международный идентификатор мобильного оборудования</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ORDER_ID</Name>
					<Comment>Идентификатор заказа</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ORDER_RETURN_ID</Name>
					<Comment>Идентификатор возврата</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ORDER_RETURN_REASON_ID</Name>
					<Comment>Идентификатор причины возврата</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PALLET_ID</Name>
					<Comment>Идентификатор палеты</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SERIAL_NUMBER</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>STAMP_ID</Name>
					<Comment>Идентификатор пломбы лота</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VENDOR_ID</Name>
					<Comment>Идентификатор магазина в Маркете</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VIRTUAL_ID</Name>
					<Comment>Идентификатор неопознанного товара, присвоенный Маркетом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CONSIGNMENT_ID</Name>
					<Comment>Идентификатор партии товара</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UIT</Name>
					<Comment>Идентификатор товара в системе склада Маркета</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/дсфЗаявкаНаПриемку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>дсфЗаявкаНаПриемку</Name>
			<Comment>Заявку на приемку товаров или заказов</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипПриемки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.дсфТипыПриемкиЯндексМаркет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДоставкиНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДоставкиОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеЗаявкиВходящие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСкладаЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеКурьераЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОтправителяГрузаЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/дсфПолучениеСведенийЯндексМаркет/Ext/Module.bsl
#Область ПрограммныйИнтерфейс
Функция НовоеОписаниеОстаткаКоличестваТовара() Экспорт
	ОстатокКоличестваТовара = Новый Структура;
	
	ОстатокКоличестваТовара.Вставить("ТипСтока", -1);
	ОстатокКоличестваТовара.Вставить("Количество", 0);
	ОстатокКоличестваТовара.Вставить("Дата", Неопределено);
	
	Возврат ОстатокКоличестваТовара;

КонецФункции

Функция НовоеОписаниеОстатковТовара() Экспорт
	ОстаткиТовара = Новый Структура;
	
	ОстаткиТовара.Вставить("ИдентификаторТовара", "");  // обычно артикул или yandexId
	
	ИдентификаторПоставщика = дсфОбщегоНазначенияЯндексМаркет.ИдентификаторПоставщика();
	Если ПустаяСтрока(ИдентификаторПоставщика) Тогда
		ЗначениеИдентификаторПоставщика = 0;
		
	Иначе
		ЗначениеИдентификаторПоставщика = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ИдентификаторПоставщика);
		
	КонецЕсли;
	
	ОстаткиТовара.Вставить("ИдентификаторПоставщика", ЗначениеИдентификаторПоставщика);
	
	ОстаткиТовара.Вставить("ИдентификаторТоварногоПредложения", "");

	ОстаткиТовара.Вставить("Остатки", Новый Массив);  // см. dsf_ПолучениеСведений.НовоеОписаниеОстаткаКоличестваТовара
	
	Возврат ОстаткиТовара;

КонецФункции

Функция НовыйРезультатЗапросаОстатковТоваров() Экспорт
	ОписаниеРезультата = Новый Структура;
	
	ОписаниеРезультата.Вставить("Успех", Ложь);
	ОписаниеРезультата.Вставить("Ошибки", Новый Массив);
	ОписаниеРезультата.Вставить("Товары", Новый Массив); // см. dsf_ПолучениеСведений.НовоеОписаниеОстатковТовара

	Возврат ОписаниеРезультата;
	
КонецФункции

// Функция - Массив сведений об остатках товаров
//
// Параметры:
//  КоличествоЗаписей			 - 	 - 
//  Смещение					 - 	 - 
//  ТаблицаНоменклатураДляОтбора - ТаблицаЗначений - 
// 
// Возвращаемое значение:
//   - 
//
Функция СведенияОбОстаткахТоваров(КоличествоЗаписей = 20,
										Смещение = 0,
										ТаблицаНоменклатураДляОтбора = Неопределено) Экспорт
										
										
	РезультатЗапросаСведений = НовыйРезультатЗапросаОстатковТоваров();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Поклажедатель = дсфОбщегоНазначенияЯндексМаркет.ПоклажедательПоУмолчанию();
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ЗапросВыборкаЭлементов = Новый Запрос;
	ЗапросВыборкаЭлементов.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	// в том случае, если указан отбор по номенклатуре, используем его, иначе формирование страницы для выдачи
	Если ТаблицаНоменклатураДляОтбора = Неопределено Или ТаблицаНоменклатураДляОтбора.Количество() = 0 Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ОбъектыХранения.Ссылка КАК ОбъектХраненияСсылка,
		               |	ОбъектыХранения.Артикул КАК Артикул
		               |ПОМЕСТИТЬ ВТ_ТаблицаОХПолная
		               |ИЗ
		               |	Справочник.ОбъектыХранения КАК ОбъектыХранения
		               |ГДЕ
		               |	ОбъектыХранения.Организация = &Организация
		               |	И ОбъектыХранения.ЭтоГруппа = ЛОЖЬ
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ОбъектХраненияСсылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ ПЕРВЫЕ 0
		               |	ВТ_ТаблицаОХПолная.ОбъектХраненияСсылка КАК ОбъектХраненияСсылка,
		               |	ВТ_ТаблицаОХПолная.Артикул КАК Артикул
		               |ПОМЕСТИТЬ ВТ_ТаблицаОХСдвиг
		               |ИЗ
		               |	ВТ_ТаблицаОХПолная КАК ВТ_ТаблицаОХПолная
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ОбъектХраненияСсылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ ПЕРВЫЕ 20
		               |	ВТ_ТаблицаОХПолная.ОбъектХраненияСсылка КАК ОбъектХраненияСсылка,
		               |	ВТ_ТаблицаОХПолная.Артикул КАК Артикул
		               |ПОМЕСТИТЬ ВТ_ОбъектыХранения
		               |ИЗ
		               |	ВТ_ТаблицаОХПолная КАК ВТ_ТаблицаОХПолная
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаОХСдвиг КАК ВТ_ТаблицаОХСдвиг
		               |		ПО ВТ_ТаблицаОХПолная.ОбъектХраненияСсылка = ВТ_ТаблицаОХСдвиг.ОбъектХраненияСсылка
		               |ГДЕ
		               |	ВТ_ТаблицаОХСдвиг.ОбъектХраненияСсылка ЕСТЬ NULL
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ОбъектХраненияСсылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ ВТ_ТаблицаОХПолная
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ ВТ_ТаблицаОХСдвиг";
		
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 0", "ПЕРВЫЕ " + Формат(Смещение, "ЧДЦ=0; ЧН=; ЧГ=0"));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 20", "ПЕРВЫЕ " +Формат(КоличествоЗаписей, "ЧДЦ=0; ЧН=; ЧГ=0"));
		
		ЗапросВыборкаЭлементов.УстановитьПараметр("Организация", Поклажедатель);

	Иначе
		ТекстЗапроса = "ВЫБРАТЬ
		               |	Номенклатура.Ссылка КАК НоменклатураСсылка
		               |ПОМЕСТИТЬ ВТ_ТаблицаНоменклатуры
		               |ИЗ
		               |	&ТаблицаИдентификаторовНоменклатуры КАК ТаблицаИдентификаторовНоменклатуры
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		               |		ПО ТаблицаИдентификаторовНоменклатуры.Артикул = Номенклатура.Артикул
		               |ГДЕ
		               |	Номенклатура.Организация = &Организация
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	НоменклатураСсылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ОбъектыХранения.Ссылка КАК ОбъектХраненияСсылка,
		               |	ОбъектыХранения.Артикул КАК Артикул
		               |ПОМЕСТИТЬ ВТ_ОбъектыХранения
		               |ИЗ
		               |	ВТ_ТаблицаНоменклатуры КАК ВТ_ТаблицаНоменклатуры
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыХранения КАК ОбъектыХранения
		               |		ПО ВТ_ТаблицаНоменклатуры.НоменклатураСсылка = ОбъектыХранения.Номенклатура
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ОбъектХраненияСсылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ ВТ_ТаблицаНоменклатуры";
		
		ЗапросВыборкаЭлементов.УстановитьПараметр("ТаблицаИдентификаторовНоменклатуры", ТаблицаНоменклатураДляОтбора);
		ЗапросВыборкаЭлементов.УстановитьПараметр("Организация", Поклажедатель);
		
	КонецЕсли;
	
	ЗапросВыборкаЭлементов.Текст = ТекстЗапроса;
	
	ЗапросВыборкаЭлементов.ВыполнитьПакет();
	
	// основной запрос
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВТ_ОбъектыХранения.ОбъектХраненияСсылка КАК ОбъектХранения,
	|	ЕСТЬNULL(ВТ_ОбъектыХранения.Артикул, """") КАК Артикул,
	|	Остатки.Состояние КАК Состояние,
	|	Остатки.Партия КАК Партия,
	|	Остатки.МестоХранения КАК МестоХранения,
	|	ЕСТЬNULL(Остатки.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(Остатки.ПланРасход, 0) КАК ПланРасход,
	|	ЕСТЬNULL(Остатки.ПланПриход, 0) КАК ПланПриход,
	|	ЕСТЬNULL(Остатки.ДатаИзменения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаИзменения,
	|	дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет.ТипСтока КАК ТипСтока,
	|	дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет.СтатусЕдиницыТовара КАК СтатусЕдиницыТовара
	|ИЗ
	|	ВТ_ОбъектыХранения КАК ВТ_ОбъектыХранения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Остатки КАК Остатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет КАК дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет
	|			ПО Остатки.Состояние = дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет.СостояниеОбъектовХранения
	|		ПО ВТ_ОбъектыХранения.ОбъектХраненияСсылка = Остатки.ОбъектХранения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбъектХранения
	|ИТОГИ
	|	МАКСИМУМ(Артикул),
	|	СУММА(Количество),
	|	СУММА(ПланРасход),
	|	СУММА(ПланПриход),
	|	МАКСИМУМ(ДатаИзменения),
	|	МАКСИМУМ(ТипСтока)
	|ПО
	|	ОбъектХранения,
	|	Состояние";

	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.ВыполнитьПакет();
	
	РезультатПоОстаткам = Результат[0];
	
	ВыборкаПоОбъектамХранения = РезультатПоОстаткам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоОбъектамХранения.Следующий() Цикл
		
		ОписаниеОстатковТоваров = НовоеОписаниеОстатковТовара();
		ОписаниеОстатковТоваров["ИдентификаторТовара"] = ВыборкаПоОбъектамХранения.Артикул;
		
		ВыборкаПоСостояниямОХ = ВыборкаПоОбъектамХранения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаПоСостояниямОХ.Следующий() Цикл
			
			ОписаниеКоличества = НовоеОписаниеОстаткаКоличестваТовара();
			
			ОписаниеКоличества["ТипСтока"] = дсфОбщегоНазначенияЯндексМаркет.КодТипаСтокаЯндексМаркетСлужебный(ВыборкаПоСостояниямОХ.ТипСтока);
			ОписаниеКоличества["Количество"] = ВыборкаПоСостояниямОХ.Количество;
			ОписаниеКоличества["Дата"] = ВыборкаПоСостояниямОХ.ДатаИзменения;

			ОписаниеОстатковТоваров["Остатки"].Добавить(ОписаниеКоличества);

		КонецЦикла;
		
		РезультатЗапросаСведений["Товары"].Добавить(ОписаниеОстатковТоваров);
	КонецЦикла; 
	
	РезультатЗапросаСведений["Успех"] = Истина;
	
	Возврат РезультатЗапросаСведений;
	
КонецФункции

Функция НовоеОписаниеСтатусаДокумента() Экспорт
	СведенияОСтатусе = Новый Структура;
	
	СведенияОСтатусе.Вставить("Документ", Неопределено);
	СведенияОСтатусе.Вставить("Статус", Справочники.СтатусыДокументов.ПустаяСсылка());
	СведенияОСтатусе.Вставить("ДатаИзменения", Неопределено);
	СведенияОСтатусе.Вставить("ИдентификаторДокумента", "");
	СведенияОСтатусе.Вставить("ИдентификаторВнешний", "");
	СведенияОСтатусе.Вставить("ИдентификаторСклада", "");
	
	Возврат СведенияОСтатусе;

КонецФункции

Функция НовыйРезультатЗапросаСтатусовПриемок() Экспорт
	ОписаниеРезультата = Новый Структура;
	
	ОписаниеРезультата.Вставить("Успех", Ложь);
	ОписаниеРезультата.Вставить("Ошибки", Новый Массив);
	ОписаниеРезультата.Вставить("Статусы", Новый Массив); // см. dsf_ПолучениеСведений.НовоеОписаниеСтатусаДокумента

	Возврат ОписаниеРезультата;
	
КонецФункции

Функция НовоеОписаниеИсторииСтатусаДокумента() Экспорт
	СведенияОбИсторииСтатусаДокумента = Новый Структура;
	
	СведенияОбИсторииСтатусаДокумента.Вставить("Документ", Неопределено);
	СведенияОбИсторииСтатусаДокумента.Вставить("ИдентификаторДокумента", "");
	СведенияОбИсторииСтатусаДокумента.Вставить("ИдентификаторВнешний", "");
	СведенияОбИсторииСтатусаДокумента.Вставить("ИдентификаторСклада", "");
	СведенияОбИсторииСтатусаДокумента.Вставить("Статусы", Новый Массив); // см. dsf_ПолучениеСведений.НовоеОписаниеСтатусаДокумента

	Возврат СведенияОбИсторииСтатусаДокумента;

КонецФункции

Функция НовыйРезультатЗапросаИсторииСтатусовПриемок() Экспорт
	ОписаниеРезультата = Новый Структура;
	
	ОписаниеРезультата.Вставить("Успех", Ложь);
	ОписаниеРезультата.Вставить("Ошибки", Новый Массив);
	ОписаниеРезультата.Вставить("ИсторияСтатусовПриемок", Новый Массив); // см. dsf_ПолучениеСведений.НовоеОписаниеИсторииСтатусаДокумента

	Возврат ОписаниеРезультата;
	
КонецФункции

// Функция - Сведения о статусах приемок
//			Важно! Статус приемки определяется по статусу связанного с ней документа ОжидаемоеПоступление.
//			Связь должна быть зафиксирована в регистре сведений dsf_СвязанныеОбъектыЗаявкаНаПриемку
//
// Параметры:
//  Документы	 - Массив - 
// 
// Возвращаемое значение:
//   - Массив структур, см. dsf_ПолучениеСведений.НовыйРезультатЗапросаСтатусовПриемок
//
Функция СведенияОСтатусахПриемок(Документы) Экспорт

	РезультатЗапросаСтатусов = НовыйРезультатЗапросаСтатусовПриемок();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	дсфЗаявкаНаПриемку.Ссылка КАК ЗаявкаНаПриемку,
	               |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(дсфЗаявкаНаПриемку.Ссылка) КАК ЗаявкаНаПриемкуИдентификатор
	               |ПОМЕСТИТЬ ВТ_ЗаявкиНаПриемку
	               |ИЗ
	               |	Документ.дсфЗаявкаНаПриемку КАК дсфЗаявкаНаПриемку
	               |ГДЕ
	               |	дсфЗаявкаНаПриемку.Ссылка В(&МассивЗаявок)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ЗаявкаНаПриемку
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗаявкиНаПриемку.ЗаявкаНаПриемку КАК ЗаявкаНаПриемку,
	               |	ВТ_ЗаявкиНаПриемку.ЗаявкаНаПриемкуИдентификатор КАК ЗаявкаНаПриемкуИдентификатор,
	               |	ЕСТЬNULL(дсфИдентификаторыЯндексМаркет.Идентификатор, 0) КАК ИдентификаторВнешний,
	               |	ЕСТЬNULL(дсфСвязанныеОбъектыЗаявкаНаПриемкуЯндексМаркет.ОжидаемоеПоступление, НЕОПРЕДЕЛЕНО) КАК ОжидаемоеПоступление
	               |ПОМЕСТИТЬ ВТ_ЗаявкиНаПриемкуПолная
	               |ИЗ
	               |	ВТ_ЗаявкиНаПриемку КАК ВТ_ЗаявкиНаПриемку
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.дсфИдентификаторыЯндексМаркет КАК дсфИдентификаторыЯндексМаркет
	               |		ПО ВТ_ЗаявкиНаПриемку.ЗаявкаНаПриемку = дсфИдентификаторыЯндексМаркет.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.дсфСвязанныеОбъектыЗаявкаНаПриемкуЯндексМаркет КАК дсфСвязанныеОбъектыЗаявкаНаПриемкуЯндексМаркет
	               |		ПО ВТ_ЗаявкиНаПриемку.ЗаявкаНаПриемку = дсфСвязанныеОбъектыЗаявкаНаПриемкуЯндексМаркет.ЗаявкаНаПриемку
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОжидаемоеПоступление
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗаявкиНаПриемкуПолная.ЗаявкаНаПриемку КАК ЗаявкаНаПриемку,
	               |	ВТ_ЗаявкиНаПриемкуПолная.ЗаявкаНаПриемкуИдентификатор КАК ЗаявкаНаПриемкуИдентификатор,
	               |	ВТ_ЗаявкиНаПриемкуПолная.ИдентификаторВнешний КАК ИдентификаторВнешний,
	               |	ЕСТЬNULL(СтатусыДокументов.Статус, ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПустаяСсылка)) КАК Статус,
	               |	ЕСТЬNULL(СтатусыДокументов.ДатаИзменения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаИзменения
	               |ИЗ
	               |	ВТ_ЗаявкиНаПриемкуПолная КАК ВТ_ЗаявкиНаПриемкуПолная
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	               |		ПО ВТ_ЗаявкиНаПриемкуПолная.ОжидаемоеПоступление = СтатусыДокументов.Документ";
	
	Запрос.УстановитьПараметр("МассивЗаявок", Документы);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ИдентификаторСклада = дсфОбщегоНазначенияЯндексМаркет.ИдентификаторСклада();
	
	Пока Выборка.Следующий() Цикл
	
		СведенияОСтатусе = НовоеОписаниеСтатусаДокумента();
		СведенияОСтатусе["Документ"] = Выборка.ЗаявкаНаПриемку;
		СведенияОСтатусе["ИдентификаторДокумента"] = XMLСтрока(Выборка.ЗаявкаНаПриемкуИдентификатор);
		СведенияОСтатусе["ИдентификаторВнешний"] = Выборка.ИдентификаторВнешний;
		СведенияОСтатусе["ИдентификаторСклада"] = ИдентификаторСклада;
		СведенияОСтатусе["Статус"] = Выборка.Статус;
		СведенияОСтатусе["ДатаИзменения"] = Выборка.ДатаИзменения;
		
		РезультатЗапросаСтатусов["Статусы"].Добавить(СведенияОСтатусе);
		
	КонецЦикла;
		
	РезультатЗапросаСтатусов["Успех"] = Истина;
	
	Возврат РезультатЗапросаСтатусов;

КонецФункции

// Функция - Сведения о статусах приемок
//			Важно! Статус приемки определяется по статусу связанного с ней документа ОжидаемоеПоступление.
//			Связь должна быть зафиксирована в регистре сведений dsf_СвязанныеОбъектыЗаявкаНаПриемку
//
// Параметры:
//  Документы	 - Массив - 
// 
// Возвращаемое значение:
//   - Массив структур, см. dsf_ПолучениеСведений.НовыйРезультатЗапросаСтатусовПриемок
//
Функция ИсторияСтатусовПриемок(Документы) Экспорт

	РезультатЗапросаИсторииСтатусов = НовыйРезультатЗапросаИсторииСтатусовПриемок();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	дсфЗаявкаНаПриемку.Ссылка КАК ЗаявкаНаПриемку,
	               |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(дсфЗаявкаНаПриемку.Ссылка) КАК ЗаявкаНаПриемкуИдентификатор
	               |ПОМЕСТИТЬ ВТ_ЗаявкиНаПриемку
	               |ИЗ
	               |	Документ.дсфЗаявкаНаПриемку КАК дсфЗаявкаНаПриемку
	               |ГДЕ
	               |	дсфЗаявкаНаПриемку.Ссылка В(&МассивЗаявок)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ЗаявкаНаПриемку
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗаявкиНаПриемку.ЗаявкаНаПриемку КАК ЗаявкаНаПриемку,
	               |	ВТ_ЗаявкиНаПриемку.ЗаявкаНаПриемкуИдентификатор КАК ЗаявкаНаПриемкуИдентификатор,
	               |	ЕСТЬNULL(дсфИдентификаторыЯндексМаркет.Идентификатор, 0) КАК ИдентификаторВнешний,
	               |	ЕСТЬNULL(дсфСвязанныеОбъектыЗаявкаНаПриемкуЯндексМаркет.ОжидаемоеПоступление, НЕОПРЕДЕЛЕНО) КАК ОжидаемоеПоступление
	               |ПОМЕСТИТЬ ВТ_ЗаявкиНаПриемкуПолная
	               |ИЗ
	               |	ВТ_ЗаявкиНаПриемку КАК ВТ_ЗаявкиНаПриемку
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.дсфИдентификаторыЯндексМаркет КАК дсфИдентификаторыЯндексМаркет
	               |		ПО ВТ_ЗаявкиНаПриемку.ЗаявкаНаПриемку = дсфИдентификаторыЯндексМаркет.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.дсфСвязанныеОбъектыЗаявкаНаПриемкуЯндексМаркет КАК дсфСвязанныеОбъектыЗаявкаНаПриемкуЯндексМаркет
	               |		ПО ВТ_ЗаявкиНаПриемку.ЗаявкаНаПриемку = дсфСвязанныеОбъектыЗаявкаНаПриемкуЯндексМаркет.ЗаявкаНаПриемку
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОжидаемоеПоступление
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗаявкиНаПриемкуПолная.ЗаявкаНаПриемку КАК ЗаявкаНаПриемку,
	               |	ВТ_ЗаявкиНаПриемкуПолная.ЗаявкаНаПриемкуИдентификатор КАК ЗаявкаНаПриемкуИдентификатор,
	               |	ВТ_ЗаявкиНаПриемкуПолная.ИдентификаторВнешний КАК ИдентификаторВнешний,
	               |	ЕСТЬNULL(СтатусыДокументовИстория.ДатаИзменения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаИзменения,
	               |	СтатусыДокументовИстория.Статус КАК Статус
	               |ИЗ
	               |	ВТ_ЗаявкиНаПриемкуПолная КАК ВТ_ЗаявкиНаПриемкуПолная
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовИстория КАК СтатусыДокументовИстория
	               |		ПО ВТ_ЗаявкиНаПриемкуПолная.ОжидаемоеПоступление = СтатусыДокументовИстория.Документ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗаявкаНаПриемку,
	               |	ДатаИзменения
	               |ИТОГИ
	               |	МИНИМУМ(ЗаявкаНаПриемкуИдентификатор),
	               |	МИНИМУМ(ИдентификаторВнешний)
	               |ПО
	               |	ЗаявкаНаПриемку";
	
	Запрос.УстановитьПараметр("МассивЗаявок", Документы);
	
	Результат = Запрос.Выполнить();
	ВыборкаПоПриемкам = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ИдентификаторСклада = дсфОбщегоНазначенияЯндексМаркет.ИдентификаторСклада();
	
	Пока ВыборкаПоПриемкам.Следующий() Цикл
		
		ИсторияСтатусаДокумента = НовоеОписаниеИсторииСтатусаДокумента();
		ИсторияСтатусаДокумента["Документ"] = ВыборкаПоПриемкам.ЗаявкаНаПриемку;
		ИсторияСтатусаДокумента["ИдентификаторДокумента"] = XMLСтрока(ВыборкаПоПриемкам.ЗаявкаНаПриемкуИдентификатор);
		ИсторияСтатусаДокумента["ИдентификаторВнешний"] = ВыборкаПоПриемкам.ИдентификаторВнешний;
		ИсторияСтатусаДокумента["ИдентификаторСклада"] = ИдентификаторСклада;
		
		ВыбокаПоСтатусам = ВыборкаПоПриемкам.Выбрать();
		Пока ВыбокаПоСтатусам.Следующий() Цикл
			СведенияОСтатусе = НовоеОписаниеСтатусаДокумента();
			СведенияОСтатусе["Документ"] = ВыбокаПоСтатусам.ЗаявкаНаПриемку;
			СведенияОСтатусе["ИдентификаторДокумента"] = XMLСтрока(ВыбокаПоСтатусам.ЗаявкаНаПриемкуИдентификатор);
			СведенияОСтатусе["ИдентификаторВнешний"] = ВыбокаПоСтатусам.ИдентификаторВнешний;
			СведенияОСтатусе["ИдентификаторСклада"] = ИдентификаторСклада;
			СведенияОСтатусе["Статус"] = ВыбокаПоСтатусам.Статус;
			СведенияОСтатусе["ДатаИзменения"] = ВыбокаПоСтатусам.ДатаИзменения;
	
			ИсторияСтатусаДокумента["Статусы"].Добавить(СведенияОСтатусе);

		КонецЦикла;
		
		РезультатЗапросаИсторииСтатусов["ИсторияСтатусовПриемок"].Добавить(ИсторияСтатусаДокумента);
		
	КонецЦикла;
		
	РезультатЗапросаИсторииСтатусов["Успех"] = Истина;
	
	Возврат РезультатЗапросаИсторииСтатусов;

КонецФункции

Функция НовыйРезультатЗапросаДеталейПриемки() Экспорт
	ОписаниеРезультата = Новый Структура;
	
	ОписаниеРезультата.Вставить("Успех", Ложь);
	ОписаниеРезультата.Вставить("Ошибки", Новый Массив); 
	ОписаниеРезультата.Вставить("ИдентификаторСклада", "");
	ОписаниеРезультата.Вставить("ИдентификаторЗаявки", "");
	ОписаниеРезультата.Вставить("ИдентификаторЗаявкиВнешний", "");
	ОписаниеРезультата.Вставить("ТипПриемки", Неопределено);
	ОписаниеРезультата.Вставить("ПериодДоставкиНачало", Неопределено);
	ОписаниеРезультата.Вставить("ПериодДоставкиОкончание", Неопределено);
	ОписаниеРезультата.Вставить("ПериодДоставкиСтрокой", "");
	ОписаниеРезультата.Вставить("ИдентификаторРеестра", "");
	ОписаниеРезультата.Вставить("ИдентификаторРеестраВнешний", "");
	ОписаниеРезультата.Вставить("ДатаРеестра", Неопределено);
	ОписаниеРезультата.Вставить("ТипРеестра", Неопределено);
	ОписаниеРезультата.Вставить("КомментарийКРеестру", "");
	ОписаниеРезультата.Вставить("ПринятыеТовары", Новый Массив); // см. dsf_СозданиеОбновлениеДанныхЯндексМаркет.НовоеОписаниеЭлементаСпискаТоваровВРеестре
	
	Возврат ОписаниеРезультата;
	
КонецФункции

Функция ДеталиПриемкиПоЗаявке(ЗаявкаНаПриемку) Экспорт

	РезультатЗапросаДеталейПриемки = НовыйРезультатЗапросаДеталейПриемки();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	дсфЗаявкаНаПриемку.Ссылка КАК ЗаявкаНаПриемку,
	               |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(дсфЗаявкаНаПриемку.Ссылка) КАК ЗаявкаНаПриемкуИдентификатор,
	               |	ЕСТЬNULL(дсфИдентификаторыЯндексМаркет.Идентификатор, 0) КАК ЗаявкаНаПриемкуИдентификаторВнешний,
	               |	дсфЗаявкаНаПриемку.Номер КАК Номер,
	               |	дсфЗаявкаНаПриемку.Дата КАК Дата,
	               |	дсфЗаявкаНаПриемку.ТипПриемки КАК ТипПриемки,
	               |	дсфЗаявкаНаПриемку.ПериодДоставкиНачало КАК ПериодДоставкиНачало,
	               |	дсфЗаявкаНаПриемку.ПериодДоставкиОкончание КАК ПериодДоставкиОкончание,
	               |	дсфЗаявкаНаПриемку.ДатаОбновления КАК ДатаОбновления,
	               |	ЕСТЬNULL(дсфСвязанныеОбъектыЗаявкаНаПриемкуЯндексМаркет.ПланПоступления, НЕОПРЕДЕЛЕНО) КАК ПланПоступления,
	               |	ЕСТЬNULL(дсфСвязанныеОбъектыЗаявкаНаПриемкуЯндексМаркет.ОжидаемоеПоступление, НЕОПРЕДЕЛЕНО) КАК ОжидаемоеПоступление
	               |ПОМЕСТИТЬ ВТ_ЗаявкаНаПриемку
	               |ИЗ
	               |	Документ.дсфЗаявкаНаПриемку КАК дсфЗаявкаНаПриемку
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.дсфИдентификаторыЯндексМаркет КАК дсфИдентификаторыЯндексМаркет
	               |		ПО дсфЗаявкаНаПриемку.Ссылка = дсфИдентификаторыЯндексМаркет.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.дсфСвязанныеОбъектыЗаявкаНаПриемкуЯндексМаркет КАК дсфСвязанныеОбъектыЗаявкаНаПриемкуЯндексМаркет
	               |		ПО дсфЗаявкаНаПриемку.Ссылка = дсфСвязанныеОбъектыЗаявкаНаПриемкуЯндексМаркет.ЗаявкаНаПриемку
	               |ГДЕ
	               |	дсфЗаявкаНаПриемку.Ссылка = &ЗаявкаНаПриемку
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ЗаявкаНаПриемку
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	дсфВерсииРеестровПриемкиЯндексМаркет.ЗаявкаНаПриемку КАК ЗаявкаНаПриемку,
	               |	дсфВерсииРеестровПриемкиЯндексМаркет.ИдентификаторРеестра КАК ИдентификаторРеестра,
	               |	дсфВерсииРеестровПриемкиЯндексМаркет.ТипРеестра КАК ТипРеестра,
	               |	дсфВерсииРеестровПриемкиЯндексМаркет.ТипРеестраКод КАК ТипРеестраКод,
	               |	дсфВерсииРеестровПриемкиЯндексМаркет.ДатаРеестра КАК ДатаРеестра,
	               |	ВТ_ЗаявкаНаПриемку.ПланПоступления КАК ПланПоступления,
	               |	ЕСТЬNULL(ВТ_ЗаявкаНаПриемку.ПланПоступления.Комментарий, """") КАК ПланПоступленияКомментарий
	               |ПОМЕСТИТЬ ВТ_ВерсииРеестраПриемкиВходящие
	               |ИЗ
	               |	РегистрСведений.дсфВерсииРеестровПриемкиЯндексМаркет КАК дсфВерсииРеестровПриемкиЯндексМаркет
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗаявкаНаПриемку КАК ВТ_ЗаявкаНаПриемку
	               |		ПО дсфВерсииРеестровПриемкиЯндексМаркет.ЗаявкаНаПриемку = ВТ_ЗаявкаНаПриемку.ЗаявкаНаПриемку
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	дсфВерсииРеестровПриемкиЯндексМаркет.ДатаРеестра УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗаявкаНаПриемку.ЗаявкаНаПриемку КАК ЗаявкаНаПриемку,
	               |	ВТ_ЗаявкаНаПриемку.ЗаявкаНаПриемкуИдентификатор КАК ЗаявкаНаПриемкуИдентификатор,
	               |	ВТ_ЗаявкаНаПриемку.ЗаявкаНаПриемкуИдентификаторВнешний КАК ЗаявкаНаПриемкуИдентификаторВнешний,
	               |	ВТ_ЗаявкаНаПриемку.Номер КАК Номер,
	               |	ВТ_ЗаявкаНаПриемку.Дата КАК Дата,
	               |	ВТ_ЗаявкаНаПриемку.ТипПриемки КАК ТипПриемки,
	               |	ВТ_ЗаявкаНаПриемку.ПериодДоставкиНачало КАК ПериодДоставкиНачало,
	               |	ВТ_ЗаявкаНаПриемку.ПериодДоставкиОкончание КАК ПериодДоставкиОкончание,
	               |	ВТ_ЗаявкаНаПриемку.ДатаОбновления КАК ДатаОбновления,
	               |	ВТ_ЗаявкаНаПриемку.ОжидаемоеПоступление КАК ОжидаемоеПоступление,
	               |	ВТ_ЗаявкаНаПриемку.ПланПоступления КАК ПланПоступления
	               |ИЗ
	               |	ВТ_ЗаявкаНаПриемку КАК ВТ_ЗаявкаНаПриемку
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВерсииРеестраПриемкиВходящие.ЗаявкаНаПриемку КАК ЗаявкаНаПриемку,
	               |	ВТ_ВерсииРеестраПриемкиВходящие.ИдентификаторРеестра КАК ИдентификаторРеестра,
	               |	ВТ_ВерсииРеестраПриемкиВходящие.ТипРеестра КАК ТипРеестра,
	               |	ВТ_ВерсииРеестраПриемкиВходящие.ТипРеестраКод КАК ТипРеестраКод,
	               |	ВТ_ВерсииРеестраПриемкиВходящие.ДатаРеестра КАК ДатаРеестра,
	               |	ВТ_ВерсииРеестраПриемкиВходящие.ПланПоступления КАК ПланПоступления,
	               |	ВТ_ВерсииРеестраПриемкиВходящие.ПланПоступленияКомментарий КАК ПланПоступленияКомментарий
	               |ИЗ
	               |	ВТ_ВерсииРеестраПриемкиВходящие КАК ВТ_ВерсииРеестраПриемкиВходящие";
	
	Запрос.УстановитьПараметр("ЗаявкаНаПриемку", ЗаявкаНаПриемку);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	РезультатДанныеОЗаявке = МассивРезультатов[2];	
	Если РезультатДанныеОЗаявке.Пустой() Тогда
		РезультатЗапросаДеталейПриемки["Успех"] = Ложь;
		РезультатЗапросаДеталейПриемки["Ошибки"].Добавить("Не найдены сведения о заявке на приемку");
		
		Возврат РезультатЗапросаДеталейПриемки;

	КонецЕсли;
	
	РезультатДанныеОРеестре = МассивРезультатов[3];	
	Если РезультатДанныеОРеестре.Пустой() Тогда
		РезультатЗапросаДеталейПриемки["Успех"] = Ложь;
		РезультатЗапросаДеталейПриемки["Ошибки"].Добавить("В системе не зарегистрирован входящий реестр приемки");
		
		Возврат РезультатЗапросаДеталейПриемки;

	КонецЕсли;
	
	
	// заявка на приемку
	Выборка = РезультатДанныеОЗаявке.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		РезультатЗапросаДеталейПриемки["ИдентификаторСклада"] = дсфОбщегоНазначенияЯндексМаркет.ИдентификаторСклада();

		РезультатЗапросаДеталейПриемки["ИдентификаторЗаявки"] = XMLСтрока(Выборка.ЗаявкаНаПриемкуИдентификатор);
		РезультатЗапросаДеталейПриемки["ИдентификаторЗаявкиВнешний"] = XMLСтрока(Выборка.ЗаявкаНаПриемкуИдентификаторВнешний);
		РезультатЗапросаДеталейПриемки["ТипПриемки"] = Выборка.ТипПриемки;
		РезультатЗапросаДеталейПриемки["ПериодДоставкиНачало"] = Выборка.ПериодДоставкиНачало;
		РезультатЗапросаДеталейПриемки["ПериодДоставкиОкончание"] = Выборка.ПериодДоставкиОкончание;
		
		Если ЗначениеЗаполнено(РезультатЗапросаДеталейПриемки["ПериодДоставкиНачало"]) 
			И ЗначениеЗаполнено(РезультатЗапросаДеталейПриемки["ПериодДоставкиОкончание"]) Тогда
			РезультатЗапросаДеталейПриемки["ПериодДоставкиСтрокой"] =
				XMLСтрока(РезультатЗапросаДеталейПриемки["ПериодДоставкиНачало"])
				+ "/"
				+ XMLСтрока(РезультатЗапросаДеталейПриемки["ПериодДоставкиОкончание"]);
				
		КонецЕсли;
		
		ОжидаемоеПоступление = Выборка.ОжидаемоеПоступление;

	КонецЦикла;
	
	// реестр
	ВыборкаПоРеестру = РезультатДанныеОРеестре.Выбрать();
	Пока ВыборкаПоРеестру.Следующий() Цикл
		
		РезультатЗапросаДеталейПриемки["ИдентификаторРеестра"] = XMLСтрока(ВыборкаПоРеестру.ПланПоступления);
		РезультатЗапросаДеталейПриемки["ИдентификаторРеестраВнешний"] = ВыборкаПоРеестру.ИдентификаторРеестра;
		РезультатЗапросаДеталейПриемки["КомментарийКРеестру"] = ВыборкаПоРеестру.ПланПоступленияКомментарий;
		
		// Важно! тип реестра определять по мстатусу плана поступления / ожидаемой приёмки
		СтатусПланаПоступления = СтатусыДокументовСервер.СтатусДокументаПоСсылке(ВыборкаПоРеестру.ПланПоступления);
		РезультатЗапросаДеталейПриемки["ТипРеестра"] = ВыборкаПоРеестру.ТипРеестра;
		
		// Важно! Уточнить, что будет являться датой фактического реестра
		// пока пишем дату плана
		РезультатЗапросаДеталейПриемки["ДатаРеестра"] = XMLСтрока(ВыборкаПоРеестру.ДатаРеестра);

	КонецЦикла;
		
	Если ЗначениеЗаполнено(ОжидаемоеПоступление) Тогда
		ТаблицаПланФактПоступления = ТаблицаПланФактОжидаемоеПоступление(ОжидаемоеПоступление);
		
		
		ТаблицаНоменклатуры = ТаблицаПланФактПоступления.Скопировать(, "Номенклатура,НоменклатураНаименование,НоменклатураАртикул");
		ТаблицаНоменклатуры.Свернуть("Номенклатура,НоменклатураНаименование,НоменклатураАртикул");
		
		Для каждого ТекСтрокаНоменклатуры Из ТаблицаНоменклатуры Цикл
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Номенклатура", ТекСтрокаНоменклатуры["Номенклатура"]);
			
			МассивСтрокПланФакт = ТаблицаПланФактПоступления.НайтиСтроки(СтруктураПоиска);
			
			СведенияОКоличестве = Новый Соответствие;
			Для каждого ТекЭлемент Из МассивСтрокПланФакт Цикл
				ПринятоПоФакту = ТекЭлемент["Факт"]; 
				
				Если ПринятоПоФакту > 0 Тогда
					СтатусЕдиницыТовара = ТекЭлемент["СтатусЕдиницыТовара"];

					Если СведенияОКоличестве["СведенияОКоличестве"] = Неопределено Тогда
						СведенияОКоличестве.Вставить(СтатусЕдиницыТовара, ПринятоПоФакту);	
						
					Иначе
						СведенияОКоличестве["СведенияОКоличестве"] = СведенияОКоличестве["СведенияОКоличестве"] + ПринятоПоФакту;
					
					КонецЕсли;

				КонецЕсли;
			
			КонецЦикла;
			
			Если СведенияОКоличестве.Количество() > 0 Тогда // записи о принятом по факту количестве присутствуют
			
				ОписаниеПринятогоТовара = дсфСозданиеОбновлениеДанныхЯндексМаркет.НовоеОписаниеЭлементаСпискаТоваровВРеестре();
			
				ОписаниеПринятогоТовара["Наименование"] = ТекСтрокаНоменклатуры["НоменклатураНаименование"];
				ОписаниеПринятогоТовара["СведенияОКоличестве"] = СведенияОКоличестве;
				
				// идентификаторы номенклатуры
				ИдентификаторыТовара = Новый Соответствие;
				ИдентификаторыТовара.Вставить(Перечисления.дсфТипыИдентификаторовЯндексМаркет.ARTICLE, ТекСтрокаНоменклатуры["НоменклатураАртикул"]);
				ОписаниеПринятогоТовара["Идентификаторы"] = ИдентификаторыТовара;
				
				РезультатЗапросаДеталейПриемки["ПринятыеТовары"].Добавить(ОписаниеПринятогоТовара);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	РезультатЗапросаДеталейПриемки["Успех"] = Истина;
	
	Возврат РезультатЗапросаДеталейПриемки;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
Функция ТаблицаПланФактОжидаемоеПоступление(ОжидаемоеПоступление) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОжидаемыеПоступления.Ссылка КАК ОжидаемоеПоступление
	               |ПОМЕСТИТЬ втДокументы
	               |ИЗ
	               |	Документ.ОжидаемоеПоступление КАК ОжидаемыеПоступления
	               |ГДЕ
	               |	ОжидаемыеПоступления.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДокументы.ОжидаемоеПоступление КАК ОжидаемоеПоступление,
	               |	ОперацииСМестамиХранения.МестоХранения КАК МестоХранения,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ОперацииСМестамиХранения.ТипОперации = ЗНАЧЕНИЕ(Справочник.ТипыОпераций.МаркировкаМестХранения)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ) КАК Промаркирован,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ОперацииСМестамиХранения.ТипОперации = ЗНАЧЕНИЕ(Справочник.ТипыОпераций.КонтрольПоступленияПоСоставу)
	               |					ИЛИ ОперацииСМестамиХранения.ТипОперации = ЗНАЧЕНИЕ(Справочник.ТипыОпераций.СвободныйКонтрольПоступленияПоСоставу)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ) КАК Проконтролирован,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ОперацииСМестамиХранения.ТипОперации = ЗНАЧЕНИЕ(Справочник.ТипыОпераций.Размещение)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ) КАК Размещен
	               |ПОМЕСТИТЬ втСостояниеМХ
	               |ИЗ
	               |	втДокументы КАК втДокументы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииСМестамиХранения КАК ОперацииСМестамиХранения
	               |		ПО втДокументы.ОжидаемоеПоступление = ОперацииСМестамиХранения.ДокументОснование
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втДокументы.ОжидаемоеПоступление,
	               |	ОперацииСМестамиХранения.МестоХранения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПланФакт.ОжидаемоеПоступление КАК ОжидаемоеПоступление,
	               |	ПланФакт.ОбъектХранения КАК ОбъектХранения,
	               |	ПланФакт.Состояние КАК Состояние,
	               |	ПланФакт.Партия КАК Партия,
	               |	ПланФакт.КонфигурацияУпаковок КАК КонфигурацияУпаковок,
	               |	ПланФакт.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
	               |	СУММА(ПланФакт.Возврат) КАК Возврат,
	               |	СУММА(ПланФакт.Факт) КАК Факт,
	               |	СУММА(ПланФакт.ФактМерный) КАК ФактМерный,
	               |	СУММА(ПланФакт.План) КАК План,
	               |	СУММА(ПланФакт.ПланНачальный) КАК ПланНачальный,
	               |	СУММА(ПланФакт.ПланМакс) КАК ПланМакс,
	               |	СУММА(ПланФакт.ПланМин) КАК ПланМин,
	               |	СУММА(ПланФакт.Проконтролировано) КАК Проконтролировано,
	               |	СУММА(ПланФакт.Промаркировано) КАК Промаркировано,
	               |	СУММА(ПланФакт.Размещено) КАК Размещено,
	               |	ПланФакт.ОбъектХранения.Номенклатура.Наименование КАК НоменклатураНаименование,
	               |	ПланФакт.ОбъектХранения.Номенклатура.Артикул КАК НоменклатураАртикул,
	               |	ПланФакт.ОбъектХранения.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ втПланФакт
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПланФактПоступления.ОжидаемоеПоступление КАК ОжидаемоеПоступление,
	               |		ПланФактПоступления.ОбъектХранения КАК ОбъектХранения,
	               |		ПланФактПоступления.Состояние КАК Состояние,
	               |		ПланФактПоступления.Партия КАК Партия,
	               |		ПланФактПоступления.КонфигурацияУпаковок КАК КонфигурацияУпаковок,
	               |		ПланФактПоступления.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
	               |		ПланФактПоступления.Возврат КАК Возврат,
	               |		ПланФактПоступления.Факт КАК Факт,
	               |		ПланФактПоступления.ФактМерный КАК ФактМерный,
	               |		ПланФактПоступления.План КАК План,
	               |		ПланФактПоступления.ПланНачальный КАК ПланНачальный,
	               |		ПланФактПоступления.ПланМакс КАК ПланМакс,
	               |		ПланФактПоступления.ПланМин КАК ПланМин,
	               |		ВЫБОР
	               |			КОГДА ЕСТЬNULL(втСостояниеМХ.Проконтролирован, ЛОЖЬ)
	               |				ТОГДА ПланФактПоступления.Факт
	               |			ИНАЧЕ 0
	               |		КОНЕЦ КАК Проконтролировано,
	               |		ВЫБОР
	               |			КОГДА ЕСТЬNULL(втСостояниеМХ.Промаркирован, ЛОЖЬ)
	               |				ТОГДА ПланФактПоступления.Факт
	               |			ИНАЧЕ 0
	               |		КОНЕЦ КАК Промаркировано,
	               |		ВЫБОР
	               |			КОГДА ЕСТЬNULL(втСостояниеМХ.Размещен, ЛОЖЬ)
	               |				ТОГДА ПланФактПоступления.Факт
	               |			ИНАЧЕ 0
	               |		КОНЕЦ КАК Размещено
	               |	ИЗ
	               |		втДокументы КАК втДокументы
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПланФактПоступленияДвижения КАК ПланФактПоступления
	               |				ЛЕВОЕ СОЕДИНЕНИЕ втСостояниеМХ КАК втСостояниеМХ
	               |				ПО ПланФактПоступления.МестоХранения = втСостояниеМХ.МестоХранения
	               |			ПО втДокументы.ОжидаемоеПоступление = ПланФактПоступления.ОжидаемоеПоступление) КАК ПланФакт
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПланФакт.ОжидаемоеПоступление,
	               |	ПланФакт.ОбъектХранения,
	               |	ПланФакт.Состояние,
	               |	ПланФакт.Партия,
	               |	ПланФакт.КонфигурацияУпаковок,
	               |	ПланФакт.ЗаказНаОтгрузку,
	               |	ПланФакт.ОбъектХранения.Номенклатура.Наименование,
	               |	ПланФакт.ОбъектХранения.Номенклатура.Артикул,
	               |	ПланФакт.ОбъектХранения.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПланПоступления.ОжидаемоеПоступление КАК ОжидаемоеПоступление,
	               |	ПланПоступления.ОбъектХранения КАК ОбъектХранения,
	               |	ПланПоступления.Состояние КАК Состояние,
	               |	ПланПоступления.Партия КАК Партия,
	               |	ПланПоступления.КонфигурацияУпаковок КАК КонфигурацияУпаковок,
	               |	ПланПоступления.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
	               |	ПланПоступления.Возврат КАК Возврат,
	               |	ПланПоступления.Факт КАК Факт,
	               |	ПланПоступления.План КАК План,
	               |	ПланПоступления.ПланНачальный КАК ПланНачальный,
	               |	ПланПоступления.План - ПланПоступления.ПланНачальный КАК Скорректировано,
	               |	ВЫБОР
	               |		КОГДА ПланПоступления.Факт >= ПланПоступления.ПланМин
	               |			ТОГДА 0
	               |		ИНАЧЕ ПланПоступления.План - ПланПоступления.Факт
	               |	КОНЕЦ КАК ОсталосьПринять,
	               |	ВЫБОР
	               |		КОГДА ПланПоступления.Факт >= ПланПоступления.ПланМакс
	               |			ТОГДА ПланПоступления.Факт - ПланПоступления.План
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Излишек,
	               |	ПланПоступления.Возврат / ЕСТЬNULL(ПланПоступления.ОбъектХранения.УпаковкаДляОтчетов.Коэффициент, 1) КАК ВозвратУпаковок,
	               |	ПланПоступления.Факт / ЕСТЬNULL(ПланПоступления.ОбъектХранения.УпаковкаДляОтчетов.Коэффициент, 1) КАК ФактУпаковок,
	               |	ПланПоступления.План / ЕСТЬNULL(ПланПоступления.ОбъектХранения.УпаковкаДляОтчетов.Коэффициент, 1) КАК ПланУпаковок,
	               |	ПланПоступления.Проконтролировано / ЕСТЬNULL(ПланПоступления.ОбъектХранения.УпаковкаДляОтчетов.Коэффициент, 1) КАК ПроконтролированоУпаковок,
	               |	ПланПоступления.Промаркировано / ЕСТЬNULL(ПланПоступления.ОбъектХранения.УпаковкаДляОтчетов.Коэффициент, 1) КАК ПромаркированоУпаковок,
	               |	ПланПоступления.Размещено / ЕСТЬNULL(ПланПоступления.ОбъектХранения.УпаковкаДляОтчетов.Коэффициент, 1) КАК РазмещеноУпаковок,
	               |	ПланПоступления.ФактМерный КАК ФактМерный,
	               |	ПланПоступления.Проконтролировано КАК Проконтролировано,
	               |	ПланПоступления.Промаркировано КАК Промаркировано,
	               |	ПланПоступления.Размещено КАК Размещено,
	               |	ПланПоступления.ПланНачальный / ЕСТЬNULL(ПланПоступления.ОбъектХранения.УпаковкаДляОтчетов.Коэффициент, 1) КАК ПланНачальныйУпаковок,
	               |	(ПланПоступления.План - ПланПоступления.ПланНачальный) / ЕСТЬNULL(ПланПоступления.ОбъектХранения.УпаковкаДляОтчетов.Коэффициент, 1) КАК СкорректированоУпаковок,
	               |	ВЫБОР
	               |		КОГДА ПланПоступления.Факт >= ПланПоступления.ПланМин
	               |			ТОГДА 0
	               |		ИНАЧЕ ПланПоступления.План - ПланПоступления.Факт
	               |	КОНЕЦ / ЕСТЬNULL(ПланПоступления.ОбъектХранения.УпаковкаДляОтчетов.Коэффициент, 1) КАК ОсталосьПринятьУпаковок,
	               |	ВЫБОР
	               |		КОГДА ПланПоступления.Факт >= ПланПоступления.ПланМакс
	               |			ТОГДА ПланПоступления.Факт - ПланПоступления.План
	               |		ИНАЧЕ 0
	               |	КОНЕЦ / ЕСТЬNULL(ПланПоступления.ОбъектХранения.УпаковкаДляОтчетов.Коэффициент, 1) КАК ИзлишекУпаковок,
	               |	ПланПоступления.ПланМин КАК ПланМин,
	               |	ПланПоступления.ПланМакс КАК ПланМакс,
	               |	ПланПоступления.НоменклатураНаименование КАК НоменклатураНаименование,
	               |	ПланПоступления.НоменклатураАртикул КАК НоменклатураАртикул,
	               |	ПланПоступления.Номенклатура КАК Номенклатура,
	               |	дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет.СтатусЕдиницыТовара КАК СтатусЕдиницыТовара,
	               |	дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет.ТипСтока КАК ТипСтока
	               |ИЗ
	               |	втПланФакт КАК ПланПоступления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет КАК дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет
	               |		ПО ПланПоступления.Состояние = дсфСоответствиеСостоянийОбъектовХраненияКодамЯндексМаркет.СостояниеОбъектовХранения";
	
	Запрос.УстановитьПараметр("Ссылка", ОжидаемоеПоступление);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();

КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
